#pragma once

/*!
* Главный статичный класс игры, который запускает и инициализирует всё остальное.
* Содержит внутри себя (в Launch) основной цикл.
* 
* Вся игра крутится вокруг единственного главного цикла. Создание других циклов обновления объектов НЕДОПУСТИМО,
* так как в этом случае не будут работать прочие менеджеры.
* 
* На данный момент запускает сцену MainMenu. Подробнее о сценах в SceneManager.h
* 
* СИСТЕМНОЕ
*/
class GameManager
{
public:
	static void Launch(); //! Инициализация всех менеджеров и главный цикл

	// Сторонние функции, которые будут запускаться (когда создается новый проект нужно заполнить эти указатели тем, что нужно)
	static void (*init_project)();
	static void (*update_project)();
	static void (*destroy_project)();

	//! Эта функция подключает сторонние функции для обработки этим движком.
	//! Вот например есть функция, которую мы хотим обновлять каждый тик (итерацию цикла игры), тогда мы просто передаем указатель на нее сюда и все.
	static void handleProject(void (*init)(), void (*update)(), void (*dest)());

private:
	static bool is_exit; //! Указывает, был ли совершён выход из игры закрытием окна или иным другим

};
